local M = {}

M.show = {
	["<leader>"] = { name = "Leader 键" },
	["<localleader>"] = { name = "Local leader 键" },
	["<SNR>"] = { name = "脚本编号" },

	["<C-F>"] = "向下翻一页",
	["<C-B>"] = "向上翻一页",
	["<C-D>"] = "向下翻半页",
	["<C-U>"] = "向下翻半页",
	["<C-E>"] = "屏幕向下滚动",
	["<C-Y>"] = "屏幕向上滚动",

	["%"] = "匹配括号跳转",

	["]"] = { name = "向前跳转" },
	["["] = { name = "向后跳转" },
	["]z"] = "跳转到折叠头部",
	["[z"] = "跳转到折叠末尾",

	["<2-LeftMouse>"] = "双击左键",
	["<2-RightMouse>"] = "双击右键",

	c = { name = "c" },
	cw = "删除至词尾并插入",

	d = { name = "删除" },
	dd = "删除行",
	dw = "删除光标至下一个词首",
	de = "删除光标至词尾",
	db = "删除光标至词首",
	["d0"] = "删除至行首",
	["d^"] = "删除至行文本头",
	["d$"] = "删除至行尾",
	da = { name = "删除周围" },
	daw = "删除单词",
	dap = "删除段落",

	g = { name = "g" },
	ga = "打印光标 ascii 码",
	gg = "移动光标到文件首行",

	y = { name = "复制" },
	yy = "复制行",
	yw = "复制光标到词首",
	ye = "复制光标到词尾",
	["y0"] = "删除至行首",
	["y^"] = "删除至行文本头",
	["y$"] = "删除至行尾",
	ya = { name = "复制周围" },
	yaw = "复制单词",
	yap = "复制段落",

	z = { name = "z" },
	za = "切换折叠状态",
	zc = "折叠",
	zC = "折叠所有",
	zm = "增加折叠级别",
	zM = "关闭所有折叠",
	zo = "打开光标处折叠",
	zO = "打开所有折叠",
	zr = "减少折叠级别",
	zR = "打开所有折叠",
	zd = "删除光标处折叠",
	zE = "删除所有折叠",
	zj = "跳转到下一个折叠的头部",
	zk = "跳转到上一个折叠的末尾",
	zn = "禁用折叠",
	zN = "启用折叠",
	zt = "光标置顶",
	zz = "光标置底",
	zb = "光标居中",
}

return M
